Revit 2027 API
UnitUtils.IsUnit Method
 Checks whether a ForgeTypeId identifies a unit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsUnit(
	ForgeTypeId unitTypeId
)
Public Shared Function IsUnit (
	unitTypeId As ForgeTypeId
) As Boolean
public:
static bool IsUnit(
	ForgeTypeId^ unitTypeId
)
static member IsUnit :
        unitTypeId : ForgeTypeId -> bool
Parameters
unitTypeId ForgeTypeId
 The identifier to check.
Return Value
Boolean
 True if the ForgeTypeId identifies a unit, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The UnitTypeId class offers unit identifiers.
See Also
Reference
UnitUtils Class
Autodesk.Revit.DB Namespace